webServiceCheckOk/Web References/WsCredify/wscredify.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="urn:server.consultas" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="urn:server.consultas" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema targetNamespace="urn:server.consultas">
      <xsd:import namespace="http://schemas.xmlsoap.org/soap/encoding/" />
      <xsd:import namespace="http://schemas.xmlsoap.org/wsdl/" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="ConsultarRequest">
    <wsdl:part name="xmlRequisicao" type="xsd:string" />
  </wsdl:message>
  <wsdl:message name="ConsultarResponse">
    <wsdl:part name="xmlResposta" type="xsd:string" />
  </wsdl:message>
  <wsdl:portType name="server.consultaPortType">
    <wsdl:operation name="Consultar">
      <documentation>Recebe uma string xml na requisição ...</documentation>
      <wsdl:input message="tns:ConsultarRequest" />
      <wsdl:output message="tns:ConsultarResponse" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="server.consultaBinding" type="tns:server.consultaPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
    <wsdl:operation name="Consultar">
      <soap:operation soapAction="urn:server.consultas#consultar" style="rpc" />
      <wsdl:input>
        <soap:body use="encoded" namespace="urn:server.consultas" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="encoded" namespace="urn:server.consultas" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="server.consulta">
    <wsdl:port name="server.consultaPort" binding="tns:server.consultaBinding">
      <soap:address location="http://webservice.credify.com.br/wscredify.php" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>